/**
 * 数字序列中的某一位的数字：
 * 
 * 数字以0123456789101112131415161718192021222324....的格式序列化
 * 
 * 求任意第n位数字
 * 
 */

 //思路一：遍历序列，累加位数，并且与n比较

// let sum = 0;

// for (let i = 0; i < n; i++){
//     while (n % 10) {
//         sum++;
//         n / 10;
//     }
//     if (sum > n) {
//         let idx = sum - n;
//         return (i / ((n - 1) * 10)) % 10;
//     }
// }


//思路二：记录一个表

//一位数：0-9         10位
//二位数：10-99       10*9=90位      
//三位数：100-999     100*9=900
//四位数：1000-9999   1000*9=9000

//根据n确定位数

